Revit 2024 API
EnergyAnalysisMaterial.Density Property
 The density of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double Density { get; }
Visual Basic
Public ReadOnly Property Density As Double
	Get
Visual C++
public:
property double Density {
	double get ();
}
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace